In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import sklearn
import scipy
import warnings
import matplotlib_inline
import sys

In [2]:
#load files from different directories
sys.path.insert(1, '../src/')
from config import TEST_DATA , TRAIN_DATA , CUSTOMER_DEMOGRAPHICS_DATA , COUPON_ITEM_DATA , CAMPAIGN_DATA , CUSTOMER_TRANSACTION_DATA ,ITEM_DATA

In [3]:
#import all csv files
def importCSV(path):
    """Import csv function 

    Args:
        path ([str]): name of the csv file with regard to DATAPATH

    Returns:
        [Pandas dataframe]
    """
    return pd.read_csv(path)

In [4]:
#import train and test csv files
train_df=importCSV(TRAIN_DATA)
test_df=importCSV(TEST_DATA)

#import other data 
campaign_df=importCSV(CAMPAIGN_DATA)
coupon_item_mapping_df=importCSV(COUPON_ITEM_DATA)
customer_demographics_df=importCSV(CUSTOMER_DEMOGRAPHICS_DATA)
customer_transaction_data_df=importCSV(CUSTOMER_TRANSACTION_DATA)
item_data_df=importCSV(ITEM_DATA)

In [46]:
train_columns=train_df.columns
print(train_columns,len(train_df))

Index(['id', 'campaign_id', 'coupon_id', 'customer_id', 'redemption_status'], dtype='object') 54858

In [48]:
print(f'the total entries are {len(train_df)} and total unique coupon id are {len(train_df.coupon_id.unique())} \
        total unique customer are {len(train_df.customer_id.unique())}')

the total entries are 54858 and total unique coupon id are 866         total unique customer are 1428

In [41]:
train_df.loc[train_df["redemption_status"]==1].head(5)

         id  campaign_id  coupon_id  customer_id  redemption_status
115     359           26        797          214                  1
168   97889           26        514          566                  1
283   72278           13        601          231                  1
430  106344            8        705         1506                  1
494    5118           13        705          257                  1

In [35]:
campaign_df.head(2)

   campaign_id campaign_type start_date  end_date
0           24             Y   21/10/13  20/12/13
1           25             Y   21/10/13  22/11/13

In [22]:
# camapign id for 14,15,16 not here.
len(campaign_df)

28

In [7]:
coupon_item_mapping_df.head()

   coupon_id  item_id
0        105       37
1        107       75
2        494       76
3        522       77
4        518       77

In [8]:
customer_demographics_df.head()

,customer_id,age_range,marital_status,rented,family_size,no_of_children,income_bracket
0,1,70+,Married,0,2,NaN,4
1,6,46-55,Married,0,2,NaN,5
2,7,26-35,NaN,0,3,1,3
3,8,26-35,NaN,0,4,2,6
4,10,46-55,Single,0,1,NaN,5

In [17]:
customer_transaction_data_df.tail()

,date,customer_id,item_id,quantity,selling_price,other_discount,coupon_discount
1324561,2013-06-30,1129,2777,1,284.60,-71.24,0.0
1324562,2013-06-30,1129,2953,4,42.74,-28.50,0.0
1324563,2013-06-30,1129,2971,6,64.12,-42.74,0.0
1324564,2013-06-30,1129,46984,1,95.82,0.00,0.0
1324565,2013-06-30,1129,64498,2,489.78,0.00,0.0

In [12]:
item_data_df.head()

   item_id  brand   brand_type       category
0        1      1  Established        Grocery
1        2      1  Established  Miscellaneous
2        3     56        Local         Bakery
3        4     56        Local        Grocery
4        5     56        Local        Grocery